In [133]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.2'

In [134]:
# filename ='ex1.csv'
# data = pd.read_csv(filename)
# data.head()

In [135]:
obj = pd.Series([2,-2,1,7,18])
obj

0     2
1    -2
2     1
3     7
4    18
dtype: int64

In [136]:
obj.array

<NumpyExtensionArray>
[2, -2, 1, 7, 18]
Length: 5, dtype: int64

In [137]:
obj2 = pd.Series([2,-2,-1,7,18], index=['a','b','c','d','e'])
obj2

a     2
b    -2
c    -1
d     7
e    18
dtype: int64

In [138]:
obj2[(obj2>0)]

a     2
d     7
e    18
dtype: int64

In [139]:
obj2*2, obj2

(a     4
 b    -4
 c    -2
 d    14
 e    36
 dtype: int64,
 a     2
 b    -2
 c    -1
 d     7
 e    18
 dtype: int64)

In [140]:
"b" in obj2, obj2["b"]

(True, -2)

In [141]:
# Da dizionario a series pandas
d = {"Oregon": 12000, "Ohio":25000, "Oklahoma": 89000, "Texas": 10000}
obj3 = pd.Series(d)
"a" in d, obj3

(False,
 Oregon      12000
 Ohio        25000
 Oklahoma    89000
 Texas       10000
 dtype: int64)

In [142]:
# Da series pandas a dizionario
obj3.to_dict()

{'Oregon': 12000, 'Ohio': 25000, 'Oklahoma': 89000, 'Texas': 10000}

In [143]:
states = ["Oklahoma", "Texas", "California", "Ohio"]
obj4 = pd.Series(d, index=states)
obj4

Oklahoma      89000.0
Texas         10000.0
California        NaN
Ohio          25000.0
dtype: float64

In [144]:
pd.isna(obj4), pd.notna(obj4)

(Oklahoma      False
 Texas         False
 California     True
 Ohio          False
 dtype: bool,
 Oklahoma       True
 Texas          True
 California    False
 Ohio           True
 dtype: bool)

In [145]:
# Sia come metodo pandas che del dataSeries
obj4.isna()

Oklahoma      False
Texas         False
California     True
Ohio          False
dtype: bool

Vediamo ora di DataFrame

In [146]:
data = {"states": ["Oklahoma", "Ohio", "California", "Nevada", "New Hampshire", "New Jersey"],
        "year":[2000, 2001, 2002, 2002, 2000, 2005],
        "pop": [1.5, 1.7, 2.1, 3.9, 1,4]
        }

In [147]:
frame = pd.DataFrame(data)
frame.head() # Stampa i primi 5 (da 0 a 4)

          states  year  pop
0       Oklahoma  2000  1.5
1           Ohio  2001  1.7
2     California  2002  2.1
3         Nevada  2002  3.9
4  New Hampshire  2000  1.0

In [148]:
frame.tail() # Stampa gli ultimi 5 dati

          states  year  pop
1           Ohio  2001  1.7
2     California  2002  2.1
3         Nevada  2002  3.9
4  New Hampshire  2000  1.0
5     New Jersey  2005  4.0

In [149]:
frame2 = pd.DataFrame(data, columns=["year", "states", "pop", "debt"])
frame2

   year         states  pop debt
0  2000       Oklahoma  1.5  NaN
1  2001           Ohio  1.7  NaN
2  2002     California  2.1  NaN
3  2002         Nevada  3.9  NaN
4  2000  New Hampshire  1.0  NaN
5  2005     New Jersey  4.0  NaN

In [150]:
frame2["states"] # Funziona sempre

0         Oklahoma
1             Ohio
2       California
3           Nevada
4    New Hampshire
5       New Jersey
Name: states, dtype: object

In [151]:
frame2.year # Non fuziona se la colonna ha lo stesso nome di un metodo

0    2000
1    2001
2    2002
3    2002
4    2000
5    2005
Name: year, dtype: int64

In [152]:
frame2.loc[2]

year            2002
states    California
pop              2.1
debt             NaN
Name: 2, dtype: object

In [153]:
frame2.iloc[2]

year            2002
states    California
pop              2.1
debt             NaN
Name: 2, dtype: object

In [154]:
frame2["debt"] = 16 # Assegno un valore
frame2

   year         states  pop  debt
0  2000       Oklahoma  1.5    16
1  2001           Ohio  1.7    16
2  2002     California  2.1    16
3  2002         Nevada  3.9    16
4  2000  New Hampshire  1.0    16
5  2005     New Jersey  4.0    16

In [155]:
frame2["debt"] = np.arange(len(frame2)) # Assegno un valore
frame2["debtt"] = 0 # Assegno un valore
frame2

   year         states  pop  debt  debtt
0  2000       Oklahoma  1.5     0      0
1  2001           Ohio  1.7     1      0
2  2002     California  2.1     2      0
3  2002         Nevada  3.9     3      0
4  2000  New Hampshire  1.0     4      0
5  2005     New Jersey  4.0     5      0

In [156]:
del frame2["debtt"]
frame2

   year         states  pop  debt
0  2000       Oklahoma  1.5     0
1  2001           Ohio  1.7     1
2  2002     California  2.1     2
3  2002         Nevada  3.9     3
4  2000  New Hampshire  1.0     4
5  2005     New Jersey  4.0     5

In [157]:
population = {'Ohio': {
    2000: 1.5,
    2002: 1.4,
    2003: 1.7},
    'Nevada': {
    2001: 2.2,
    2002: 2.5,
    2003: 3.1
}}

In [158]:
frame3 = pd.DataFrame(population)
frame3 # Va a creare un valore mancante se non c'è la key

      Ohio  Nevada
2000   1.5     NaN
2002   1.4     2.5
2003   1.7     3.1
2001   NaN     2.2

In [159]:
frame3.index.name = 'years'
frame3.columns.name = 'states'
frame3

states  Ohio  Nevada
years
2000     1.5     NaN
2002     1.4     2.5
2003     1.7     3.1
2001     NaN     2.2